{
    "top_stories": [
        {
            "title": "Dave McKean on how he experienced the sexual assault allegations against Neil Gaiman",
            "content": "HQ\n\nThe allegations of sexual assault involving Neil Gaiman have only just begun. It has been some time since we heard the news, but there is still no final jud...",
            "url": "https://www.gamereactor.eu/dave-mckean-on-how-he-experienced-the-sexual-assault-allegations-against-neil-gaiman-1539013/",
            "published_at": "2025-05-07T08:31:57.000000Z"
        },
        {
            "title": "US and China to open trade talks in Geneva amid tariff pressures",
            "content": "HQ\n\nThe latest news on the United States and China . We now know that the United States and China will hold high-level trade discussions in Geneva on Saturday, ...",
            "url": "https://www.gamereactor.eu/us-and-china-to-open-trade-talks-in-geneva-amid-tariff-pressures-1539003/",
            "published_at": "2025-05-07T08:28:46.000000Z"
        },
        {
            "title": "Franco Colapinto benefits from tumultuous night in Alpine after resignation of Team Principal",
            "content": "HQ\n\nIt has been a turbulent night at Alpine, the English-French Formula 1 team (formerly Renault) with the surprise resignation of Oliver Oakes as Team Principa...",
            "url": "https://www.gamereactor.eu/franco-colapinto-benefits-from-tumultuous-night-in-alpine-after-resignation-of-team-principal-1538993/",
            "published_at": "2025-05-07T08:24:42.000000Z"
        }
    ],
    "aggregated_news": {
        "sports": [
            {
                "title": "Football gossip: Mbeumo, Huijsen, Tah, Ndicka, Fernandez",
                "content": "Newcastle are interested in Brentford's Bryan Mbeumo but could be deterred by his price tag, while the Magpies will also not enter a summer-long pursuit of Bour...",
                "url": "https://www.bbc.com/sport/football/articles/c9856dd18p3o",
                "published_at": "2025-05-01T20:11:18.000000Z"
            },
            {
                "title": "Nkunku wants to leave Chelsea - Sunday's gossip",
                "content": "Chelsea's Christopher Nkunku wants to leave the club, Aston Villa may struggle to sign Marcus Rashford if they do not qualify for Champions League football and ...",
                "url": "https://www.bbc.com/sport/football/articles/ckg2envl30xo",
                "published_at": "2025-05-03T19:27:47.000000Z"
            },
            {
                "title": "Sturgeon: EHRC Could Make Trans Lives 'Unliveable'",
                "content": "Nicola Sturgeon has broken her silence over the Supreme Court ruling that a woman is a biological female. She’s still bitter, telling reporters:\n\n“I think s...",
                "url": "https://order-order.com/2025/05/06/sturgeon-ehrc-could-make-trans-lives-unliveable/",
                "published_at": "2025-05-06T11:38:24.000000Z"
            }
        ],
        "politics": [
            {
                "title": "Multi-party politics heightens danger for muddled Labour",
                "content": "This article is an on-site version of our Inside Politics newsletter. Subscribers can sign up here to get the newsletter delivered every weekday. If you’re no...",
                "url": "https://www.ft.com/content/593e8e6c-8d08-47a5-8550-9920cc7a211a",
                "published_at": "2025-05-02T08:52:34.000000Z"
            },
            {
                "title": "Nigel Farage claims transformation of British politics as Reform makes major gains",
                "content": "Speaking as local election wins poured in from across England for Reform UK on Friday, Nigel Farage was adamant that this was just the start of his journey to b...",
                "url": "https://www.ft.com/content/db93435f-2d41-4abc-b84d-5d7fa9bb9b45",
                "published_at": "2025-05-02T17:49:31.000000Z"
            },
            {
                "title": "Reform wins Runcorn byelection by just six votes – what the result means for Labour and the Tories",
                "content": "One story dominates the elections held on May 1 in England: the dramatic Reform surge. The Runcorn and Helsby byelection was a stunning win for Nigel Farage’s...",
                "url": "https://theconversation.com/reform-wins-runcorn-byelection-by-just-six-votes-what-the-result-means-for-labour-and-the-tories-255739",
                "published_at": "2025-05-02T12:24:44.000000Z"
            }
        ]
    }
}