{
    "top_stories": [
        {
            "title": "Bristol street sex workers help police to stop child abuse",
            "content": "How street sex workers are helping police stop child abuse\n\n13 minutes ago Share Save Rachel Stonehouse BBC West Investigations Reporting fromBristol Emma Halle...",
            "url": "https://www.bbc.com/news/articles/c625yk01772o",
            "published_at": "2025-05-06T23:10:18.000000Z"
        },
        {
            "title": "Lincolnshire council took months to fix abuse victim's door lock",
            "content": "Abuse victim fled ex but council left her in unsecure home\n\n15 minutes ago Share Save Leanne Crawford BBC Yorkshire and Lincolnshire Investigations Share Save\n\n...",
            "url": "https://www.bbc.com/news/articles/cvgnxj41v0lo",
            "published_at": "2025-05-06T23:08:05.000000Z"
        },
        {
            "title": "Bobby Sands statue investigated by Belfast council planners",
            "content": "Bobby Sands statue investigated by council planners\n\n20 minutes ago Share Save Brendan Hughes BBC News NI political reporter Share Save\n\nGoogle The statue was u...",
            "url": "https://www.bbc.com/news/articles/cly1yj27pemo",
            "published_at": "2025-05-06T23:01:55.000000Z"
        }
    ],
    "aggregated_news": {
        "technology": [
            {
                "source": "TheNewsAPI",
                "title": "Elizabeth Line: New technology shows which carriages are busy",
                "content": "Elizabeth Line station screens show busy carriages\n\nNew technology on the Elizabeth line shows commuters which carriages are quietest\n\nPassengers at some Elizab...",
                "url": "https://www.bbc.com/news/articles/cjeww5x4vl9o",
                "published_at": "2025-04-11T05:02:09.000000Z"
            },
            {
                "source": "TheNewsAPI",
                "title": "Nintendo confirms: Joy-Con 2 joysticks lack Hall Effect technology",
                "content": "HQ\n\nDrifting sticks are something that has been a recurring problem among many modern controllers. Not least the Switch whose Joy-Cons were downright infamous f...",
                "url": "https://www.gamereactor.eu/nintendo-confirms-joy-con-2-joysticks-lack-hall-effect-technology-1525823/",
                "published_at": "2025-04-08T06:33:05.000000Z"
            },
            {
                "source": "TheNewsAPI",
                "title": "Audio technology group Waves hello to £300m London float",
                "content": "An audio technology business used by many of the world's leading musicians is plotting a £300m City flotation in a boost to London's flagging stock market.\n\nSk...",
                "url": "https://news.sky.com/story/lse-13354693",
                "published_at": "2025-04-24T09:01:00.000000Z"
            }
        ]
    }
}